import random
word_list = ['референдум', 'операция', 'путешествие', 'вернисаж', 'следопыт', 'рукомойник', 'болельщик', 'театральность', 'умышленность', 'благодать']
def get_word(word_list):
    get_word = random.choice(word_list)
    return get_word.upper()

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                   --------
                   |      |
                   |      O
                   |    - T -
                   |      |
                   |     / \
                   -
                ''',
                # голова, торс, обе руки, одна нога
                '''
                   --------
                   |      |
                   |      O
                   |    - T -
                   |      |
                   |     / 
                   -
                ''',
                # голова, торс, обе руки
                '''
                   --------
                   |      |
                   |      O
                   |    - T -
                   |      |
                   |      
                   -
                ''',
                # голова, торс и одна рука
                '''
                   --------
                   |      |
                   |      O
                   |    - T
                   |      |
                   |     
                   -
                ''',
                # голова и торс
                '''
                   --------
                   |      |
                   |      O
                   |      T
                   |      |  
                   |     
                   --------
                ''',
                # голова
                '''
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   --------
                ''',
                # начальное состояние
                '''
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   --------
                '''
    ]
    return stages[tries]

def play(words):
    
